       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBOLINIT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           01 NAMES     PIC X(16).
           COPY BOOK.
       LINKAGE SECTION.
           01 TESTNAME  PIC X(16).
           01 SAIDA     PIC X(16).
       PROCEDURE DIVISION.
       MAIN.
            MOVE "IKARO" TO WS-NOME
            MOVE "SALES" TO WS-SOBRENOME

            DISPLAY WS-PESSOA.
        FINISH.
            STOP RUN.
       END PROGRAM COBOLINIT.
